InformationRegisters/ПодчиненностьСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодчиненностьСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВышестоящаяСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияИспользованияШтатногоРасписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИспользованияШтатногоРасписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаЛетныхЭкипажей</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаЛетныхЭкипажей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажаШахтеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтажаШахтеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВСтруктуреПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НадбавкаЗаВредностьРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкладТарифМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрядКатегорияНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонныйКоэффициентРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СевернаяНадбавкаРазмерМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Comment>АПК:58 Способ отражения описывает счет и субконто</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСеткаНадбавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудоваяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТрудовыеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияПриема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческийМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОТУправленческийМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПозицияШтатногоРасписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтруктураПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктураПредприятия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетСтруктуреЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СостояниеСтруктурыПредприятия/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьДатыСозданияВСтруктуреПредприятия");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления, необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.35.69";
	Обработчик.Процедура = "СостояниеСтруктурыПредприятия.ЗаполнитьДатыСозданияВСтруктуреПредприятия";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("656a4c7c-ff44-4395-869e-aa1aacd1d6ae");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизитов жизненного цикла элементов справочника ""Структура предприятия"".'");

КонецПроцедуры

// Уточняет текст запроса списка структуры предприятия полями состояния.
//
// Параметры:
//   ТекстЗапроса - Строка - модифицируемый текст запроса
//   ВключатьВычисляемыеПоляСостояния - Булево - добавлять поля состояния на текущую дату
Процедура УточнитьЗапросСпискаСтруктурыПредприятия(ТекстЗапроса, ВключатьВычисляемыеПоляСостояния) Экспорт

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[0];
	Для Каждого ОператорЗапроса Из ЗапросПакета.Операторы Цикл
		УточнитьОператорЗапросаСпискаСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса, ВключатьВычисляемыеПоляСостояния);
	КонецЦикла;

	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();

КонецПроцедуры

// Дополняет текст запроса условиями отбора по представлению структуры предприятия.
//
// Параметры:
//   Запрос - Запрос - модифицируемый запрос
//   ИмяВТПредставления - Строка - имя временной таблицы с представлением структуры предприятия
Процедура УточнитьЗапросПоПредставлениюСтруктураПредприятия(Запрос, ИмяВТПредставления) Экспорт

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);

	ЗапросПакета = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросСхемыФормирующийВТ(СхемаЗапроса, ИмяВТПредставления);
	Если ЗапросПакета = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'В схеме запросов не найден запрос для уточнения состояния структуры предприятия'");
	КонецЕсли;

	Для Каждого ОператорЗапроса Из ЗапросПакета.Операторы Цикл
		УточнитьОтборОператораЗапросаПоПредставлениюСтруктураПредприятия(ОператорЗапроса);
	КонецЦикла;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();

КонецПроцедуры

// Уточняет запрос по состоянию структуры предприятия.
//
// Параметры:
//   Запрос - Запрос - модифицируемый запрос
//   ПараметрыУточнения - Структура - параметры уточнения запроса
Процедура УточнитьЗапросПоСостояниюСтруктурыПредприятия(Запрос, ПараметрыУточнения) Экспорт

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);

	ЗапросПакета = ЗапросПакетаДляУточненияСостоянияСтруктурыПредприятия(СхемаЗапроса, ПараметрыУточнения);
	Если ЗапросПакета = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'В схеме запросов не найден запрос для уточнения состояния структуры предприятия'");
	КонецЕсли;

	Для Каждого ОператорЗапроса Из ЗапросПакета.Операторы Цикл
		УточнитьОператорЗапросаПоСостояниюСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса, ПараметрыУточнения);
	КонецЦикла;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();

КонецПроцедуры

// Уточняет запрос измененных элементов источника реквизитами состояния структуры предприятия.
//
// Параметры:
//   Запрос - Запрос - модифицируемый запрос
//   РеквизитыИсточника - КоллекцияОбъектовМетаданных - реквизиты справочника-источника
Процедура УточнитьЗапросИзмененныхЭлементовИсточника(Запрос, РеквизитыИсточника) Экспорт

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);

	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[0];
	Для Каждого ОператорЗапроса Из ЗапросПакета.Операторы Цикл
		УточнитьОператорЗапросаИзмененныхЭлементовИсточника(ЗапросПакета, ОператорЗапроса, РеквизитыИсточника);
	КонецЦикла;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');

КонецПроцедуры

// Дополняет список исключаемых реквизитов именами реквизитов жизненного цикла структуры предприятия, отсутствующими в источнике.
//
// Параметры:
//   СписокИсключаемых - Массив из Строка - дополняемый список имен реквизитов.
//   РеквизитыИсточника - КоллекцияОбъектовМетаданных - реквизиты справочника-источника.
Процедура ДополнитьСписокИсключаемыхРеквизитов(СписокИсключаемых, РеквизитыИсточника) Экспорт

	Для Каждого ИмяРеквизита Из ИменаРеквизитовЖизненногоЦиклаСтруктурыПредприятия() Цикл
		Если РеквизитыИсточника.Найти(ИмяРеквизита) = Неопределено Тогда
			СписокИсключаемых.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Выполняет отложенное обновление: заполняет даты создания в элементах справочника СтруктураПредприятия.
//
// Параметры:
//   ПараметрыОбновления - Структура - параметры механизма отложенного обновления:
//     * Обработанные - Массив из СправочникСсылка.СтруктураПредприятия - список уже обработанных элементов
Процедура ЗаполнитьДатыСозданияВСтруктуреПредприятия(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка НЕ В (&Обработанные)
		|	И СтруктураПредприятия.ДатаСоздания = &ПустаяДата";

	Обработанные = Новый Массив;
	Если ПараметрыОбновления <> Неопределено Тогда
		Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
			//@skip-check structure-key-modification
			ПараметрыОбновления.Вставить("Обработанные");
		Иначе
			Обработанные = ПараметрыОбновления.Обработанные;
		КонецЕсли;
	КонецЕсли;

	Запрос.УстановитьПараметр("Обработанные", Обработанные);

	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;

	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.СтруктураПредприятия");
	ЭлементБлокировки.ИсточникДанных = ОбновляемыеДанные;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");

	ПодразделенияКОбработке = ОбновляемыеДанные.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ЭлементБлокировки = Блокировка.Добавить("Справочник.СтруктураПредприятия");
	ЭлементБлокировки.ИсточникДанных = ОрганизационнаяСтруктура.ВышестоящиеПодразделения(ПодразделенияКОбработке);
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "ВышестоящееПодразделение");

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();

		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ПодразделенияКОбработке, Истина);
		ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
		ОбновитьСведенияПодразделений(ПодразделенияКОбработке, Истина);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка обновления сведений подразделений структуры предприятия'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Обновляет сведения подразделений структуры предприятия в регистрах штатного расписания.
//
// Параметры:
//   ОбновляемыеПодразделения - Массив из СправочникСсылка.СтруктураПредприятия - подразделения для обновления.
//   ЭтоОбработчикОбновления - Булево - признак вызова из обработчика обновления ИБ.
//   ПроверятьСоответствиеСтруктур - Булево - проверять соответствие структуры предприятия структуре юр. лиц.
Процедура ОбновитьСведенияПодразделений(ОбновляемыеПодразделения, ЭтоОбработчикОбновления = Ложь,
	ПроверятьСоответствиеСтруктур = Истина) Экспорт

	Если ОбновляемыеПодразделения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	СтруктурыСоответствуют = Не Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц.Получить();
	УстановитьПривилегированныйРежим(Ложь);

	Если ПроверятьСоответствиеСтруктур И СтруктурыСоответствуют Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОбновления = ПараметрыОбновленияСведенийПодразделений();
	ПараметрыОбновления.ПроверятьИспользованиеИсторииИзмененияШтатногоРасписания = Не ЭтоОбработчикОбновления;
	ПараметрыОбновления.ОтключитьОбновлениеСтруктурыШтатногоРасписания = Ложь;

	УправлениеШтатнымРасписанием.ОбновитьСведенияПодразделений(ОбновляемыеПодразделения, ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УточнитьОтборОператораЗапросаПоПредставлениюСтруктураПредприятия(ОператорЗапроса)

	ОператорЗапроса.Отбор.Добавить(
		"(&ПоказыватьНовыеПодразделения
		|	ИЛИ (СтруктураПредприятия.Сформировано
		|		И СтруктураПредприятия.ДатаСоздания <= &ДатаАктуальности))");
	ОператорЗапроса.Отбор.Добавить(
		"(&ПоказыватьРасформированныеПодразделения
		|	ИЛИ НЕ СтруктураПредприятия.Расформировано
		|		ИЛИ СтруктураПредприятия.ДатаРасформирования > &ДатаАктуальности)");

КонецПроцедуры

Процедура УточнитьОператорЗапросаСпискаСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса, ВключатьВычисляемыеПоляСостояния)

	Если Не ОператорЗапросаИспользуетСтруктуруПредприятия(ОператорЗапроса) Тогда
		Возврат;
	КонецЕсли;

	ДобавитьПоляЖизненногоЦиклаСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса);

	Если ВключатьВычисляемыеПоляСостояния Тогда
		ДобавитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, "СформированоНаСегодня", 
			"ВЫБОР
			|	КОГДА СтруктураПредприятия.ДатаСоздания > &ДатаОкончания
			|			ИЛИ СтруктураПредприятия.ДатаСоздания = ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ЛОЖЬ
			|	ИНАЧЕ СтруктураПредприятия.Сформировано
			|КОНЕЦ");
		ДобавитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, "РасформированоНаСегодня", 
			"ВЫБОР
			|	КОГДА СтруктураПредприятия.ДатаРасформирования > &ДатаОкончания
			|			И &ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ЛОЖЬ
			|	ИНАЧЕ СтруктураПредприятия.Расформировано
			|КОНЕЦ");
	КонецЕсли;

КонецПроцедуры

Процедура УточнитьОператорЗапросаИзмененныхЭлементовИсточника(ЗапросПакета, ОператорЗапроса, РеквизитыИсточника)

	Если Не ОператорЗапросаИспользуетСтруктуруПредприятия(ОператорЗапроса) Тогда
		Возврат;
	КонецЕсли;

	ДобавитьВыражениеПоляОператораЗапроса(
		ЗапросПакета, ОператорЗапроса, "ДатаСозданияЭлементаСтруктуры", "СтруктураПредприятия.ДатаСоздания");

	Для Каждого ИмяРеквизита Из ИменаРеквизитовЖизненногоЦиклаСтруктурыПредприятия() Цикл
		ДобавитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, ИмяРеквизита,
			ВыражениеПоляРеквизитаИсточника(РеквизитыИсточника, ИмяРеквизита));
	КонецЦикла;

	УточнитьУсловиеИзмененияЭлементаСтруктуры(ОператорЗапроса, РеквизитыИсточника);

КонецПроцедуры

Функция ЗапросПакетаДляУточненияСостоянияСтруктурыПредприятия(СхемаЗапроса, ПараметрыУточнения)

	ИмяВТ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ИмяВТ", "");
	Если ЗначениеЗаполнено(ИмяВТ) Тогда
		Возврат ЗарплатаКадрыОбщиеНаборыДанных.ЗапросСхемыФормирующийВТ(СхемаЗапроса, ИмяВТ);
	КонецЕсли;

	Возврат СхемаЗапроса.ПакетЗапросов[0];

КонецФункции

Процедура УточнитьОператорЗапросаПоСостояниюСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса, ПараметрыУточнения)

	Если Не ОператорЗапросаИспользуетСтруктуруПредприятия(ОператорЗапроса) Тогда
		Возврат;
	КонецЕсли;

	УстановитьВыражениеПоляОператораЗапроса(
		ЗапросПакета, ОператорЗапроса, "Расформировано", ВыражениеПоляРасформированоСтруктурыПредприятия(ПараметрыУточнения));
	УстановитьВыражениеПоляОператораЗапроса(
		ЗапросПакета, ОператорЗапроса, "ДатаРасформирования", "СтруктураПредприятия.ДатаРасформирования");

	УдалитьОтборыОператораЗапросаПоСтаромуСостояниюСтруктурыПредприятия(ОператорЗапроса);
	УдалитьИсточникОператораЗапроса(ОператорЗапроса, "Справочник.ПодразделенияОрганизаций");

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ДобавлятьОтбор", Истина) Тогда
		ОператорЗапроса.Отбор.Добавить(УсловиеОтбораПоСостояниюСтруктурыПредприятия(ПараметрыУточнения));
	КонецЕсли;

КонецПроцедуры

Функция ОператорЗапросаИспользуетСтруктуруПредприятия(ОператорЗапроса)

	Возврат ОператорЗапроса.Источники.НайтиПоИмени("Справочник.СтруктураПредприятия") <> Неопределено;

КонецФункции

Процедура ДобавитьПоляЖизненногоЦиклаСтруктурыПредприятия(ЗапросПакета, ОператорЗапроса)

	Для Каждого ИмяРеквизита Из ИменаРеквизитовЖизненногоЦиклаСтруктурыПредприятия() Цикл
		ДобавитьВыражениеПоляОператораЗапроса(
			ЗапросПакета, ОператорЗапроса, ИмяРеквизита, СтрШаблон("СтруктураПредприятия.%1", ИмяРеквизита));
	КонецЦикла;

КонецПроцедуры

Функция ИменаРеквизитовЖизненногоЦиклаСтруктурыПредприятия()

	ИменаРеквизитов = Новый Массив;//Массив Из Строка
	ИменаРеквизитов.Добавить("Сформировано");
	ИменаРеквизитов.Добавить("ДатаСоздания");
	ИменаРеквизитов.Добавить("Расформировано");
	ИменаРеквизитов.Добавить("ДатаРасформирования");

	Возврат ИменаРеквизитов;

КонецФункции

Функция ВыражениеПоляРеквизитаИсточника(РеквизитыИсточника, ИмяРеквизита)

	Если РеквизитыИсточника.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат СтрШаблон("ТаблицаИсточника.%1", ИмяРеквизита);
	КонецЕсли;

	Если ИмяРеквизита = "Сформировано" Тогда
		Возврат "ИСТИНА";
	ИначеЕсли ИмяРеквизита = "ДатаСоздания" Тогда
		Возврат "&ПустаяДата";
	КонецЕсли;

	Возврат "НЕОПРЕДЕЛЕНО";

КонецФункции

Процедура УточнитьУсловиеИзмененияЭлементаСтруктуры(ОператорЗапроса, РеквизитыИсточника)

	КоличествоОтборов = ОператорЗапроса.Отбор.Количество();
	Если КоличествоОтборов = 0 Тогда
		Возврат;
	КонецЕсли;

	УсловияСостояния = УсловияИзмененияСостоянияСтруктурыПредприятия(РеквизитыИсточника);
	ПодстрокаПоискаУсловия = "СтруктураПредприятия.Ссылка ЕСТЬ NULL";
	Для ИндексУсловия = 0 По КоличествоОтборов - 1 Цикл
		Условие = ОператорЗапроса.Отбор[ИндексУсловия];
		Если СтрНайти(Строка(Условие), ПодстрокаПоискаУсловия) > 0 Тогда
			НовоеУсловие = СтрШаблон("(%1 ИЛИ %2)", Строка(Условие), СтрСоединить(УсловияСостояния, " ИЛИ "));
			ОператорЗапроса.Отбор[ИндексУсловия] = Новый ВыражениеСхемыЗапроса(НовоеУсловие);
			Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция УсловияИзмененияСостоянияСтруктурыПредприятия(РеквизитыИсточника)

	Условия = Новый Массив;//Массив Из Строка

	Если РеквизитыИсточника.Найти("Сформировано") = Неопределено Тогда
		Условия.Добавить("НЕ СтруктураПредприятия.Сформировано");
	Иначе
		ДобавитьУсловиеИзмененияРеквизитаИсточника(Условия, "Сформировано");
	КонецЕсли;

	Если РеквизитыИсточника.Найти("ДатаСоздания") = Неопределено Тогда
		Условия.Добавить("СтруктураПредприятия.Сформировано И СтруктураПредприятия.ДатаСоздания = &ПустаяДата");
	Иначе
		ДобавитьУсловиеИзмененияРеквизитаИсточника(Условия, "ДатаСоздания");
	КонецЕсли;

	Если РеквизитыИсточника.Найти("Расформировано") <> Неопределено Тогда
		ДобавитьУсловиеИзмененияРеквизитаИсточника(Условия, "Расформировано");
	КонецЕсли;

	Если РеквизитыИсточника.Найти("ДатаРасформирования") <> Неопределено Тогда
		ДобавитьУсловиеИзмененияРеквизитаИсточника(Условия, "ДатаРасформирования");
	КонецЕсли;

	Возврат Условия;

КонецФункции

Процедура ДобавитьУсловиеИзмененияРеквизитаИсточника(Условия, ИмяРеквизита)
	Условия.Добавить(СтрШаблон("СтруктураПредприятия.%1 <> ТаблицаИсточника.%1", ИмяРеквизита));
КонецПроцедуры

Процедура УстановитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, ПсевдонимПоля, ТекстВыражения)

	Колонка = ЗапросПакета.Колонки.Найти(ПсевдонимПоля);
	Если Колонка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИндексКолонки = ЗапросПакета.Колонки.Индекс(Колонка);
	ОператорЗапроса.ВыбираемыеПоля.Установить(ИндексКолонки, Новый ВыражениеСхемыЗапроса(ТекстВыражения));

КонецПроцедуры

Процедура ДобавитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, ПсевдонимПоля, ТекстВыражения)

	Колонка = ЗапросПакета.Колонки.Найти(ПсевдонимПоля);
	Если Колонка <> Неопределено Тогда
		УстановитьВыражениеПоляОператораЗапроса(ЗапросПакета, ОператорЗапроса, ПсевдонимПоля, ТекстВыражения);
		Возврат;
	КонецЕсли;

	ОператорЗапроса.ВыбираемыеПоля.Добавить(ТекстВыражения);
	ЗапросПакета.Колонки[ЗапросПакета.Колонки.Количество() - 1].Псевдоним = ПсевдонимПоля;

КонецПроцедуры

Процедура УдалитьОтборыОператораЗапросаПоСтаромуСостояниюСтруктурыПредприятия(ОператорЗапроса)

	ПодстрокаПоискаОтборов = "Расформирован";
	КоличествоОтборов = ОператорЗапроса.Отбор.Количество();
	Для НомерОтбора = 1 По КоличествоОтборов Цикл
		ИндексОтбора = КоличествоОтборов - НомерОтбора;
		Отбор = ОператорЗапроса.Отбор[ИндексОтбора];
		Если СтрНайти(Строка(Отбор), ПодстрокаПоискаОтборов) > 0 Тогда
			ОператорЗапроса.Отбор.Удалить(ИндексОтбора);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьИсточникОператораЗапроса(ОператорЗапроса, ИмяИсточника)

	Источник = ОператорЗапроса.Источники.НайтиПоИмени(ИмяИсточника);
	Если Источник = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ИсточникОператора Из ОператорЗапроса.Источники Цикл
		УдалитьСоединенияСИсточником(ИсточникОператора.Соединения, ИмяИсточника);
	КонецЦикла;

	ОператорЗапроса.Источники.Удалить(ОператорЗапроса.Источники.Индекс(Источник));

КонецПроцедуры

Процедура УдалитьСоединенияСИсточником(Соединения, ИмяИсточника)

	Соединение = Соединения.НайтиПоИмени(ИмяИсточника);
	Если Соединение <> Неопределено Тогда
		Соединения.Удалить(Соединения.Индекс(Соединение));
	КонецЕсли;

КонецПроцедуры

Функция ВыражениеПоляРасформированоСтруктурыПредприятия(ПараметрыУточнения)

	ИмяПараметра = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ИмяПараметраДаты", "");
	Если ЗначениеЗаполнено(ИмяПараметра) Тогда
		Возврат СтрШаблон("СтруктураПредприятия.Расформировано И СтруктураПредприятия.ДатаРасформирования <= &%1", ИмяПараметра);
	КонецЕсли;

	Возврат "СтруктураПредприятия.Расформировано";

КонецФункции

Функция УсловиеОтбораПоСостояниюСтруктурыПредприятия(ПараметрыУточнения)

	ИмяПараметра = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ИмяПараметраДаты", "");
	Если ЗначениеЗаполнено(ИмяПараметра) Тогда
		Условие = СтрШаблон("НЕ СтруктураПредприятия.Расформировано ИЛИ СтруктураПредприятия.ДатаРасформирования > &%1", ИмяПараметра);
	Иначе
		Условие = "НЕ СтруктураПредприятия.Расформировано";
	КонецЕсли;

	ИмяПараметра = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ИмяПараметраПоказыватьРасформированные", "");
	Если ЗначениеЗаполнено(ИмяПараметра) Тогда
		Условие = СтрШаблон("&%1 ИЛИ (%2)", ИмяПараметра, Условие);
	КонецЕсли;

	ИмяПараметра = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыУточнения, "ИмяПараметраРазрешенныхПодразделений", "");
	Если ЗначениеЗаполнено(ИмяПараметра) Тогда
		Условие = СтрШаблон("(%1) ИЛИ СтруктураПредприятия.Ссылка В (&%2)", Условие, ИмяПараметра);
	КонецЕсли;

	Возврат СтрШаблон("(%1)", Условие);

КонецФункции

Функция ПараметрыОбновленияСведенийПодразделений()

	ПараметрыОбновления = УправлениеШтатнымРасписанием.ПараметрыОбновленияСведенийПодразделений();
	ЗаполнитьПараметрыОбновленияСведенийПодразделений(ПараметрыОбновления);

	Возврат ПараметрыОбновления;

КонецФункции

Функция ЗаполнитьПараметрыОбновленияСведенийПодразделений(ПараметрыОбновления)

	ЗапросВТ = ОрганизационнаяСтруктура.ЗапросВТДатыОкончанияМестаПозицииВСтруктуреПредприятия();
	ПараметрыОбновления.ТекстЗапросаВспомогательныеТаблицы = ЗапросВТ.Текст;

	ПодстрокиЗамены = ПараметрыОбновления.ПодстрокиЗамены;
	ПодстрокиЗамены.ТаблицаПодразделения = "Справочник.СтруктураПредприятия";
	ПодстрокиЗамены.ТаблицаПодчиненностьПодразделений = "РегистрСведений.ПодчиненностьСтруктурныхЕдиниц";
	ПодстрокиЗамены.ПолеПодчиненноеПодразделение = "ПодчиненностьПодразделений.СтруктурнаяЕдиница";
	ПодстрокиЗамены.ПолеВышестоящееПодразделение = "ПодчиненностьПодразделений.ВышестоящаяСтруктурнаяЕдиница";

	Если ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда
		ПодстрокиЗамены.ТаблицаШтатноеРасписание = "РегистрСведений.ИсторияИспользованияШтатногоРасписания";
		ПодстрокиЗамены.ТаблицаШтатноеРасписаниеРасширенная =
			"ВТДатыОкончанияМестаПозицииВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
			|	ПО ПодчиненностьПодразделений.СтруктурнаяЕдиница =
			|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания";
		ПодстрокиЗамены.УсловиеСоединения =
			"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция =
			|	ШтатноеРасписание.ПозицияШтатногоРасписания";
		ПодстрокиЗамены.УсловиеИспользуется = "ШтатноеРасписание.Используется";
		ПодстрокиЗамены.ПолеПозицияШтатногоРасписания = "ШтатноеРасписание.ПозицияШтатногоРасписания";
		ПодстрокиЗамены.ПолеДата =
			"ВЫБОР
			|	КОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаНачала > ШтатноеРасписание.Дата
			|		ТОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаНачала
			|	ИНАЧЕ ШтатноеРасписание.Дата
			|КОНЕЦ";
		ПодстрокиЗамены.ПолеМаксимальнаяДатаИзменений = "ШтатноеРасписание.Дата";
		ПодстрокиЗамены.ПолеМаксимальнаяДата = СтрШаблон(
			"ВЫБОР
			|	КОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаОкончания < %1 Тогда
			|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаОкончания
			|	ИНАЧЕ %1
			|КОНЕЦ",
			ПодстрокиЗамены.ПолеМаксимальнаяДатаИзменений);
		ПодстрокиЗамены.ПолеИспользуется = ПодстрокиЗамены.УсловиеИспользуется;
	Иначе
		ПодстрокиЗамены.ТаблицаШтатноеРасписание = "Справочник.ШтатноеРасписание";
		ПодстрокиЗамены.ТаблицаШтатноеРасписаниеРасширенная =
			"ВТДатыОкончанияМестаПозицииВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
			|	ПО ПодчиненностьПодразделений.СтруктурнаяЕдиница =
			|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание";
		ПодстрокиЗамены.УсловиеСоединения =
			"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = ШтатноеРасписание.Ссылка";
		ПодстрокиЗамены.УсловиеИспользуется =
			"ШтатноеРасписание.Утверждена
			|	И НЕ ШтатноеРасписание.ГруппаПозицийПодразделения";
		ПодстрокиЗамены.ПолеПозицияШтатногоРасписания = "ШтатноеРасписание.Ссылка";
		ПодстрокиЗамены.ПолеДата =
			"ВЫБОР
			|	КОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаНачала >
			|			ШтатноеРасписание.ДатаУтверждения
			|		ТОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаНачала
			|	ИНАЧЕ ШтатноеРасписание.ДатаУтверждения
			|КОНЕЦ";
		ПодстрокиЗамены.ПолеМаксимальнаяДатаИзменений =
			"ВЫБОР
			|	КОГДА ШтатноеРасписание.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|		ТОГДА ШтатноеРасписание.ДатаУтверждения
			|	ИНАЧЕ ШтатноеРасписание.ДатаЗакрытия
			|КОНЕЦ";
		ПодстрокиЗамены.ПолеМаксимальнаяДата = СтрШаблон(
			"ВЫБОР
			|	КОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаОкончания < %1 Тогда
			|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.ДатаОкончания
			|	ИНАЧЕ %1
			|КОНЕЦ",
			ПодстрокиЗамены.ПолеМаксимальнаяДатаИзменений);
		ПодстрокиЗамены.ПолеИспользуется =
			"ШтатноеРасписание.Утверждена
			|	И ВЫБОР
			|		КОГДА ШтатноеРасписание.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ НЕ ШтатноеРасписание.Закрыта
			|	КОНЕЦ
			|	И НЕ ШтатноеРасписание.ГруппаПозицийПодразделения";
	КонецЕсли;

	Возврат ПараметрыОбновления;

КонецФункции

#КонецОбласти
